STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_image_io.c
/**
 ******************************************************************************
 * @file   stm32ipl_image_io.c
 * @author SRA AI Application Team
 * @brief  STM32 Image Processing Library - image read/write functions
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include "stm32ipl.h"
#include "stm32ipl_imlib_int.h"

#ifdef STM32IPL_ENABLE_IMAGE_IO
#ifdef STM32IPL_ENABLE_JPEG
#ifdef STM32IPL_ENABLE_HW_JPEG_CODEC
#include "stm32ipl_image_io_jpg_hw.h"
#else /* STM32IPL_ENABLE_HW_JPEG_CODEC */
#include "stm32ipl_image_io_jpg_sw.h"
#endif /* STM32IPL_ENABLE_HW_JPEG_CODEC */
#endif /* STM32IPL_ENABLE_JPEG */

#include <stdio.h>
#include <ctype.h>
#include "ff.h"

#ifdef __cplusplus
extern "C" {
#endif

#define BI_RGB              0
#define BI_RLE8             1
#define BI_RLE4             2
#define BI_BITFIELDS        3

#define RGB555_RED_MASK     0x7C00
#define RGB555_GREEN_MASK   0x03E0
#define RGB555_BLUE_MASK    0x001F

#define RGB565_RED_MASK     0xF800
#define RGB565_GREEN_MASK   0x07E0
#define RGB565_BLUE_MASK    0x001F

typedef enum _ImageFileFormatType
{
	iplFileFormatUnknown, iplFileFormatBMP,
	// TODO: iplFileFormatPBM. Not supported.
	iplFileFormatPPM,
	iplFileFormatPGM,
	iplFileFormatJPG,
} ImageFileFormatType;

/* Returns the image file format by analyzing the file extension.
 * BMP, PPM, PGM, JPEG formats are supported.
 * filename	Name of the input file.
 * return	image file format.
 */
static ImageFileFormatType getImageFileFormat(const char *filename)
{
	ImageFileFormatType format = iplFileFormatUnknown;
	size_t len;
	char *upFilename;
	char *ptr;

	if (!filename)
		return iplFileFormatUnknown;

	len = strlen(filename);

	/* Convert to upper case. */
	upFilename = xalloc(len);
	strcpy(upFilename, filename);

	for (size_t i = 0; i < len; i++)
		upFilename[i] = toupper(upFilename[i]);

	ptr = upFilename + len;

	if (len >= 5) {
		if ((ptr[-1] == 'G') && (ptr[-2] == 'E') && (ptr[-3] == 'P') && (ptr[-4] == 'J') && (ptr[-5] == '.'))
			format = iplFileFormatJPG;
	}
	if (len >= 4) {
		if ((ptr[-1] == 'G') && (ptr[-2] == 'P') && (ptr[-3] == 'J') && (ptr[-4] == '.'))
			format = iplFileFormatJPG;
		else
			if ((ptr[-1] == 'P') && (ptr[-2] == 'M') && (ptr[-3] == 'B') && (ptr[-4] == '.'))
				format = iplFileFormatBMP;
			else
				if ((ptr[-1] == 'M') && (ptr[-2] == 'P') && (ptr[-3] == 'P') && (ptr[-4] == '.'))
					format = iplFileFormatPPM;
				else
					if ((ptr[-1] == 'M') && (ptr[-2] == 'G') && (ptr[-3] == 'P') && (ptr[-4] == '.'))
						format = iplFileFormatPGM;
	}

	xfree(upFilename);

	return format;
}

/* Checks if the given palette contains grayscale items.
 * palette		Palette to be checked.
 * colorUsed	Number of items to be considered.
 * return		true if the palette has grayscale items, false otherwise.
 */
static bool grayscalePalette(uint32_t *palette, uint32_t colorUsed)
{
	if (!palette)
		return false;

	for (uint32_t i = 0; i < colorUsed; i++) {
		uint8_t b = palette[i];
		uint8_t g = palette[i] >> 8;
		uint8_t r = palette[i] >> 16;
		if ((b != g) | (b != r))
			return false;
	}

	return true;
}

/* Reads BMP image file; supported files are: 1, 4, 8 bits/pixel with palette;
 * 16 bits/pixels with or without BITFIELDS; 24 bits/pixels; compressed BI_RGB and BI_BITFIELDS.
 * The generated image will be:
 * 	- Binary in case the input file has 1 bit/pixel with black and white palette.
 * 	- Grayscale in case the input file has 8 bits/pixel with a complete grayscale.
 * palette (equal RGB channels for all the palette items).
 * 	- RGB888 in case the input file has 24 bits/pixel.
 * 	- RGB565 for the remaining cases.
 * img		Image read. The pixel data is allocated internally and must be released
 * with STM32Ipl_ReleaseData(); assuming that input img->data is null.
 * fp		Pointer to the input file structure.
 * return	stm32ipl_err_Ok on success, errors otherwise.
 */
static stm32ipl_err_t readBmp(image_t *img, FIL *fp)
{
	uint32_t dataOffset; /* The offset, in bytes, from the beginning of the file to the image pixels. */
	uint32_t infoHeaderSize; /* The number of bytes of the header. */
	int32_t width; /* The width of the bitmap, in pixels. */
	int32_t height; /* The height of the bitmap, in pixels. */
	uint16_t bitCount; /* The number of bits per pixel (bpp). */
	uint32_t compression; /* The type of compression used. */
	uint32_t colorUsed; /* The number of colors used. */
	uint32_t lineSize; /* The size of a bitmap line (in bytes). */
	uint8_t header[54];
	uint8_t *pHeader;
	uint32_t bytesRead;
	uint8_t *outData;
	uint32_t paletteSize;
	uint8_t *lineData;
	uint32_t line;
	uint8_t *ptr;
	uint32_t rMask;
	uint32_t gMask;
	uint32_t bMask;

	if (!img || !fp)
		return stm32ipl_err_InvalidParameter;

	STM32Ipl_Init(img, 0, 0, (image_bpp_t)0, 0);

	if (f_lseek(fp, 0) != FR_OK)
		return stm32ipl_err_SeekingFile;

	/* Read file header and info header (54 bytes). */
	if ((f_read(fp, header, sizeof(header), (UINT*)&bytesRead) != FR_OK) || bytesRead != sizeof(header))
		return stm32ipl_err_ReadingFile;

	pHeader = (uint8_t*)header;

	/* Read the data offset. */
	dataOffset = pHeader[10] + (pHeader[11] << 8) + (pHeader[12] << 16) + (pHeader[13] << 24);

	/* Read the size of the info header. */
	infoHeaderSize = pHeader[14] + (pHeader[15] << 8) + (pHeader[16] << 16) + (pHeader[17] << 24);
	if ((infoHeaderSize != 40) /* BITMAPINFOHEADER */
	&& (infoHeaderSize != 52) /* BITMAPV2INFOHEADER */
	&& (infoHeaderSize != 56) /* BITMAPV3INFOHEADER */
	&& (infoHeaderSize != 108) /* BITMAPV4HEADER */
	&& (infoHeaderSize != 124)) /* BITMAPV5HEADER */
		return stm32ipl_err_UnsupportedFormat;

	/* Read the bitmap width. */
	width = pHeader[18] + (pHeader[19] << 8) + (pHeader[20] << 16) + (pHeader[21] << 24);

