STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_image_io.c
	/* Read the bitmap height. */
	height = pHeader[22] + (pHeader[23] << 8) + (pHeader[24] << 16) + (pHeader[25] << 24);

	/* Read the bpp. */
	bitCount = pHeader[28] + (pHeader[29] << 8);
	if ((bitCount != 1) && (bitCount != 4) && (bitCount != 8) && (bitCount != 16) && (bitCount != 24))
		return stm32ipl_err_UnsupportedFormat;

	/* Read the compression. Only BI_RGB and BI_BITFIELDS are supported. */
	compression = pHeader[30] + (pHeader[31] << 8) + (pHeader[32] << 16) + (pHeader[33] << 24);
	if (compression != BI_RGB && compression != BI_BITFIELDS)
		return stm32ipl_err_UnsupportedFormat;

	/* Read the number of colors used in the palette. */
	colorUsed = pHeader[46] + (pHeader[47] << 8) + (pHeader[48] << 16) + (pHeader[49] << 24);
	if (colorUsed == 0)
		colorUsed = 1 << bitCount;

	lineSize = (((width * bitCount) + 31) / 32) * 4;

	/* Evaluate eventual bit fields. */
	if ((compression == BI_BITFIELDS) && (bitCount == 16)) {
		uint8_t mask[4];
		/* Read the three bit masks. */
		if ((f_read(fp, mask, sizeof(mask), (UINT*)&bytesRead) != FR_OK) || bytesRead != sizeof(mask))
			return stm32ipl_err_ReadingFile;

		rMask = mask[0] + (mask[1] << 8) + (mask[2] << 16) + (mask[3] << 24);

		if ((f_read(fp, mask, sizeof(mask), (UINT*)&bytesRead) != FR_OK) || bytesRead != sizeof(mask))
			return stm32ipl_err_ReadingFile;

		gMask = mask[0] + (mask[1] << 8) + (mask[2] << 16) + (mask[3] << 24);

		if ((f_read(fp, mask, sizeof(mask), (UINT*)&bytesRead) != FR_OK) || bytesRead != sizeof(mask))
			return stm32ipl_err_ReadingFile;

		bMask = mask[0] + (mask[1] << 8) + (mask[2] << 16) + (mask[3] << 24);
	} else {
		/* Default for no compression is RGB555. */
		rMask = RGB555_RED_MASK;
		gMask = RGB555_GREEN_MASK;
		bMask = RGB555_BLUE_MASK;
	}

	switch (bitCount) {
		case 1: {
			uint32_t palette[2];

			paletteSize = colorUsed * sizeof(uint32_t);

			/* Skip the header. */
			if (f_lseek(fp, dataOffset - paletteSize) != FR_OK)
				return stm32ipl_err_SeekingFile;

			/* Read the palette. */
			if ((f_read(fp, palette, paletteSize, (UINT*)&bytesRead) != FR_OK) || bytesRead != paletteSize)
				return stm32ipl_err_ReadingFile;

			/* If the palette is made of black and white colors, the output image will be binary, RGB565 otherwise. */
			if ((palette[0] == 0x0 && palette[1] == 0xFFFFFF) || (palette[0] == 0xFFFFFF && palette[1] == 0x0)) {
				/* Black and white colors --> binary output. */

				uint32_t *outRow;
				uint32_t offset = lineSize / 4;

				/* Allocate memory for pixel data (binary). */
				outData = xalloc0(STM32Ipl_DataSize(width, abs(height), IMAGE_BPP_BINARY));
				if (!outData)
					return stm32ipl_err_OutOfMemory;

				lineData = xalloc(lineSize);
				if (!lineData) {
					xfree(outData);
					return stm32ipl_err_OutOfMemory;
				}

				/* Jump to the first or last line. */
				line = dataOffset + ((height > 0) ? (lineSize * (height - 1)) : 0);
				if (f_lseek(fp, line) != FR_OK) {
					xfree(lineData);
					xfree(outData);
					return stm32ipl_err_SeekingFile;
				}

				outRow = (uint32_t*)outData;

				for (uint32_t i = 0; i < abs(height); i++) {
					uint8_t value;
					uint8_t k;
					uint8_t *inData;

					value = 0;
					k = 0;
					inData = (uint8_t*)lineData;

					if ((f_read(fp, lineData, lineSize, (UINT*)&bytesRead) != FR_OK) || bytesRead != lineSize) {
						xfree(lineData);
						xfree(outData);
						return stm32ipl_err_ReadingFile;
					}

					for (uint32_t j = 0; j < width; k--, j++) {
						if (!(j % 8)) {
							value = (*inData++);
							k = 7;
						}
						IMAGE_PUT_BINARY_PIXEL_FAST(outRow, j, palette[(value >> k) & 1]);
					}

					outRow += offset;

					if (height > 0) {
						line -= lineSize;
						if (line >= dataOffset) {
							if (f_lseek(fp, line) != FR_OK) {
								xfree(lineData);
								xfree(outData);
								return stm32ipl_err_SeekingFile;
							}
						}
					} else {
						line += lineSize;
					}
				}

				xfree(lineData);
				lineData = 0;

				STM32Ipl_Init(img, width, abs(height), IMAGE_BPP_BINARY, outData);
			} else {
				/* Not black and white colors --> RGB565 output. */

				uint16_t *outPixel;

				/* Allocate memory for pixel data (RGB565). */
				outData = xalloc(width * abs(height) * 2);
				if (!outData)
					return stm32ipl_err_OutOfMemory;

				lineData = xalloc(lineSize);
				if (!lineData) {
					xfree(outData);
					return stm32ipl_err_OutOfMemory;
				}

				/* Jump to the first or last line. */
				line = dataOffset + ((height > 0) ? (lineSize * (height - 1)) : 0);
				if (f_lseek(fp, line) != FR_OK) {
					xfree(lineData);
					xfree(outData);
					return stm32ipl_err_SeekingFile;
				}

				outPixel = (uint16_t*)outData;
				for (uint32_t i = 0; i < abs(height); i++) {
					uint8_t value = 0;
					uint8_t k = 0;

					if ((f_read(fp, lineData, lineSize, (UINT*)&bytesRead) != FR_OK) || bytesRead != lineSize) {
						xfree(lineData);
						xfree(outData);
						return stm32ipl_err_ReadingFile;
					}

					ptr = lineData;

					for (uint32_t j = 0; j < width; k--, j++) {
						uint8_t index;
						uint8_t r;
						uint8_t g;
						uint8_t b;

						if (!(j % 8)) {
							value = (*ptr++);
							k = 7;
						}

						index = (value >> k) & 0x1;
						r = palette[index] >> 16;
						g = palette[index] >> 8;
						b = palette[index];

						*outPixel++ = (uint16_t)COLOR_R8_G8_B8_TO_RGB565(r, g, b);
					}

					if (height > 0) {
						line -= lineSize;
						if (line >= dataOffset) {
							if (f_lseek(fp, line) != FR_OK) {
								xfree(lineData);
								xfree(outData);
								return stm32ipl_err_SeekingFile;
							}
						}
					} else {
						line += lineSize;
					}
				}

				xfree(lineData);
				lineData = 0;

				STM32Ipl_Init(img, width, abs(height), IMAGE_BPP_RGB565, outData);
			}

			break;
		}

		case 4: {
			uint16_t *outPixel;
			uint32_t palette[16];

			paletteSize = colorUsed * sizeof(uint32_t);

			/* Skip the header. */
			if (f_lseek(fp, dataOffset - paletteSize) != FR_OK)
				return stm32ipl_err_SeekingFile;

			/* Read the palette. */
			if ((f_read(fp, palette, paletteSize, (UINT*)&bytesRead) != FR_OK) || bytesRead != paletteSize)
				return stm32ipl_err_ReadingFile;

