STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_image_io.c
			/* Allocate memory for pixel data (RGB565). */
			outData = xalloc(width * abs(height) * 2);
			if (!outData)
				return stm32ipl_err_OutOfMemory;

			lineData = xalloc(lineSize);
			if (!lineData) {
				xfree(outData);
				return stm32ipl_err_OutOfMemory;
			}

			/* Jump to the first or last line. */
			line = dataOffset + ((height > 0) ? (lineSize * (height - 1)) : 0);
			if (f_lseek(fp, line) != FR_OK) {
				xfree(lineData);
				xfree(outData);
				return stm32ipl_err_SeekingFile;
			}

			outPixel = (uint16_t*)outData;
			for (uint32_t i = 0; i < abs(height); i++) {
				if ((f_read(fp, lineData, lineSize, (UINT*)&bytesRead) != FR_OK) || bytesRead != lineSize) {
					xfree(lineData);
					xfree(outData);
					return stm32ipl_err_ReadingFile;
				}

				ptr = lineData;
				for (uint32_t j = 0; j < width;) {
					uint8_t value = (*ptr++);
					uint8_t index = value >> 4;
					uint8_t r = palette[index] >> 16;
					uint8_t g = palette[index] >> 8;
					uint8_t b = palette[index];

					*outPixel++ = (uint16_t)COLOR_R8_G8_B8_TO_RGB565(r, g, b);

					j++;
					if (j < width) {
						index = value & 0xF;
						r = palette[index] >> 16;
						g = palette[index] >> 8;
						b = palette[index];

						*outPixel++ = (uint16_t)COLOR_R8_G8_B8_TO_RGB565(r, g, b);
					}
					j++;
				}

				if (height > 0) {
					line -= lineSize;
					if (line >= dataOffset) {
						if (f_lseek(fp, line) != FR_OK) {
							xfree(lineData);
							xfree(outData);
							return stm32ipl_err_SeekingFile;
						}
					}
				} else {
					line += lineSize;
				}
			}

			xfree(lineData);
			lineData = 0;

			STM32Ipl_Init(img, width, abs(height), IMAGE_BPP_RGB565, outData);

			break;
		}

		case 8: {
			uint32_t palette[256];

			paletteSize = colorUsed * sizeof(uint32_t);

			/* Skip the header. */
			if (f_lseek(fp, dataOffset - paletteSize) != FR_OK)
				return stm32ipl_err_SeekingFile;

			/* Read the palette. */
			if ((f_read(fp, palette, paletteSize, (UINT*)&bytesRead) != FR_OK) || bytesRead != paletteSize)
				return stm32ipl_err_ReadingFile;

			/* In case of grayscale palette, the output image will be Grayscale, RGB565 otherwise. */
			if (grayscalePalette(palette, colorUsed)) {
				/* Grayscale palette --> Grayscale output. */
				uint8_t *outPixel;

				/* Allocate memory for pixel data (Grayscale). */
				outData = xalloc(width * abs(height));
				if (!outData)
					return stm32ipl_err_OutOfMemory;

				lineData = xalloc(lineSize);
				if (!lineData) {
					xfree(outData);
					return stm32ipl_err_OutOfMemory;
				}

				/* Jump to the first or last line. */
				line = dataOffset + ((height > 0) ? (lineSize * (height - 1)) : 0);
				if (f_lseek(fp, line) != FR_OK) {
					xfree(lineData);
					xfree(outData);
					return stm32ipl_err_SeekingFile;
				}

				outPixel = (uint8_t*)outData;
				for (uint32_t i = 0; i < abs(height); i++) {
					if ((f_read(fp, lineData, lineSize, (UINT*)&bytesRead) != FR_OK) || bytesRead != lineSize) {
						xfree(lineData);
						xfree(outData);
						return stm32ipl_err_ReadingFile;
					}

					ptr = lineData;
					for (uint32_t j = 0; j < width; j++)
						*outPixel++ = palette[*ptr++];

					if (height > 0) {
						line -= lineSize;
						if (line >= dataOffset) {
							if (f_lseek(fp, line) != FR_OK) {
								xfree(lineData);
								xfree(outData);
								return stm32ipl_err_SeekingFile;
							}
						}
					} else {
						line += lineSize;
					}
				}

				xfree(lineData);
				lineData = 0;

				STM32Ipl_Init(img, width, abs(height), IMAGE_BPP_GRAYSCALE, outData);
			} else {
				/* Not grayscale palette --> RGB565 output. */

				uint16_t *outPixel;

				/* Allocate memory for pixel data (RGB565). */
				outData = xalloc(width * abs(height) * 2);
				if (!outData)
					return stm32ipl_err_OutOfMemory;

				lineData = xalloc(lineSize);
				if (!lineData) {
					xfree(outData);
					return stm32ipl_err_OutOfMemory;
				}

				/* Jump to the first or last line. */
				line = dataOffset + ((height > 0) ? (lineSize * (height - 1)) : 0);
				if (f_lseek(fp, line) != FR_OK) {
					xfree(lineData);
					xfree(outData);
					return stm32ipl_err_SeekingFile;
				}

				outPixel = (uint16_t*)outData;
				for (uint32_t i = 0; i < abs(height); i++) {
					if ((f_read(fp, lineData, lineSize, (UINT*)&bytesRead) != FR_OK) || bytesRead != lineSize) {
						xfree(lineData);
						xfree(outData);
						return stm32ipl_err_ReadingFile;
					}

					ptr = lineData;
					for (uint32_t j = 0; j < width; j++) {
						uint8_t index = (*ptr++);
						uint8_t r = palette[index] >> 16;
						uint8_t g = palette[index] >> 8;
						uint8_t b = palette[index];

						*outPixel++ = (uint16_t)COLOR_R8_G8_B8_TO_RGB565(r, g, b);
					}

					if (height > 0) {
						line -= lineSize;
						if (line >= dataOffset) {
							if (f_lseek(fp, line) != FR_OK) {
								xfree(lineData);
								xfree(outData);
								return stm32ipl_err_SeekingFile;
							}
						}
					} else {
						line += lineSize;
					}
				}

				xfree(lineData);
				lineData = 0;

				STM32Ipl_Init(img, width, abs(height), IMAGE_BPP_RGB565, outData);
			}

			break;
		}

		case 16: {
			uint16_t *outPixel;
			uint16_t *inPixel;

			/* Skip the header. */
			if (f_lseek(fp, dataOffset) != FR_OK)
				return stm32ipl_err_SeekingFile;

			/* Allocate memory for pixel data (RGB565). */
			outData = xalloc(width * abs(height) * 2);
			if (!outData)
				return stm32ipl_err_OutOfMemory;

			lineData = xalloc(lineSize);
			if (!lineData) {
				xfree(outData);
				return stm32ipl_err_OutOfMemory;
			}

			/* Jump to the first or last line. */
			line = dataOffset + ((height > 0) ? (lineSize * (height - 1)) : 0);

			if (f_lseek(fp, line) != FR_OK) {
				xfree(outData);
				return stm32ipl_err_SeekingFile;
			}

			outPixel = (uint16_t*)outData;

			for (uint32_t i = 0; i < abs(height); i++) {
				if ((f_read(fp, lineData, lineSize, (UINT*)&bytesRead) != FR_OK) || bytesRead != lineSize) {
					xfree(lineData);
					xfree(outData);
					return stm32ipl_err_ReadingFile;
				}

				inPixel = (uint16_t*)lineData;

