STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_image_io.c
				for (uint32_t j = 0; j < width; j++) {
					uint16_t value = *inPixel;

					if (compression && (rMask == RGB565_RED_MASK) && (gMask == RGB565_GREEN_MASK)
							&& (bMask == RGB565_BLUE_MASK))
						/* RGB565 case. */
						*outPixel++ = value;
					else
						/* RGB555 case. */
						*outPixel++ = ((value & rMask) << 1) | ((value & gMask) << 1) | (value & bMask);

					inPixel++;
				}

				if (height > 0) {
					line -= lineSize;
					if (line >= dataOffset) {
						if (f_lseek(fp, line) != FR_OK) {
							xfree(lineData);
							xfree(outData);
							return stm32ipl_err_SeekingFile;
						}
					}
				} else {
					line += lineSize;
				}
			}

			xfree(lineData);
			lineData = 0;

			STM32Ipl_Init(img, width, abs(height), IMAGE_BPP_RGB565, outData);

			break;
		}

		case 24: {
			uint8_t *outPixel;
			uint32_t outLineSize = width * 3;

			/* Skip the header. */
			if (f_lseek(fp, dataOffset) != FR_OK)
				return stm32ipl_err_SeekingFile;

			/* Allocate memory for pixel data (RGB888). */
			outData = xalloc(outLineSize * abs(height));
			if (!outData)
				return stm32ipl_err_OutOfMemory;

			lineData = xalloc(lineSize);
			if (!lineData) {
				xfree(outData);
				return stm32ipl_err_OutOfMemory;
			}

			/* Jump to the first or last line. */
			line = dataOffset + ((height > 0) ? (lineSize * (height - 1)) : 0);

			if (f_lseek(fp, line) != FR_OK) {
				xfree(lineData);
				xfree(outData);
				return stm32ipl_err_SeekingFile;
			}

			outPixel = (uint8_t*)outData;

			for (uint32_t i = 0; i < abs(height); i++) {
				if ((f_read(fp, lineData, lineSize, (UINT*)&bytesRead) != FR_OK) || bytesRead != lineSize) {
					xfree(lineData);
					xfree(outData);
					return stm32ipl_err_ReadingFile;
				}

				memcpy(outPixel, lineData, outLineSize);

				outPixel += outLineSize;

				if (height > 0) {
					line -= lineSize;
					if (line >= dataOffset) {
						if (f_lseek(fp, line) != FR_OK) {
							xfree(lineData);
							xfree(outData);
							return stm32ipl_err_SeekingFile;
						}
					}
				} else {
					line += lineSize;
				}
			}

			xfree(lineData);
			lineData = 0;

			STM32Ipl_Init(img, width, abs(height), IMAGE_BPP_RGB888, outData);

			break;
		}

		default:
			return stm32ipl_err_UnsupportedFormat;
	};

	return stm32ipl_err_Ok;
}

/* Reads PNM image file. The supported formats are:
 * - plain PGM (Grayscale, ASCII).
 * - raw PGM (Grayscale, binary).
 * - plain PPM (RGB888, ASCII).
 * - raw PPM (RGB888, binary).
 * The generated image will be IMAGE_BPP_GRAYSCALE or IMAGE_BPP_RGB888, depending
 * on the actual image content.
 * img		Image read; the pixel data is allocated internally and must be released
 * with STM32Ipl_ReleaseData(); assuming that input img->data is null.
 * fp 		Pointer to the input file structure.
 * return	stm32ipl_err_Ok on success, errors otherwise.
 */
static stm32ipl_err_t readPnm(image_t *img, FIL *fp)
{
	uint32_t size;
	uint32_t width;
	uint32_t height;
	UINT bytesRead;
	uint32_t number;
	uint8_t sector[512];
	uint8_t number_ppm;
	bool valid = false;
	uint8_t *outData;

	enum
	{
		EAT_WHITESPACE, EAT_COMMENT, EAT_NUMBER
	} mode = EAT_WHITESPACE;

	if (!img || !fp)
		return stm32ipl_err_InvalidParameter;

	STM32Ipl_Init(img, 0, 0, (image_bpp_t)0, 0);

	if (f_lseek(fp, 0) != FR_OK)
		return stm32ipl_err_SeekingFile;

	if ((f_read(fp, sector, 2, (UINT*)&bytesRead) != FR_OK) || bytesRead != 2)
		return stm32ipl_err_ReadingFile;

	number = 0;

	/* Read bpp. */
	number_ppm = sector[1];

	/* "P1" = plain PBM (binary, ASCII, not supported)
	 * "P2" = plain PGM (Grayscale, ASCII)
	 * "P3" = plain PPM (RGB888, ASCII)
	 * "P4" = raw PBM (binary, not supported)
	 * "P5" = raw PGM (Grayscale)
	 * "P6" = raw PPM (RGB888)
	 */
	if ((number_ppm != '2') && (number_ppm != '3') && (number_ppm != '5') && (number_ppm != '6'))
		return stm32ipl_err_UnsupportedFormat;

	do {
		if ((f_read(fp, sector, 1, &bytesRead) != FR_OK) || bytesRead != 1)
			return stm32ipl_err_ReadingFile;

		if (mode == EAT_WHITESPACE) {
			if (sector[0] == '#') {
				mode = EAT_COMMENT;
			} else
				if (('0' <= sector[0]) && (sector[0] <= '9')) {
					number = sector[0] - '0';
					mode = EAT_NUMBER;
				}
		} else
			if (mode == EAT_COMMENT) {
				if ((sector[0] == '\n') || (sector[0] == '\r')) {
					mode = EAT_WHITESPACE;
				}
			} else
				if (mode == EAT_NUMBER) {
					if (('0' <= sector[0]) && (sector[0] <= '9')) {
						number = (number * 10) + sector[0] - '0';
					} else {
						valid = true;
					}
				}
	} while (!valid);

	width = number;
	number = 0;
	mode = EAT_WHITESPACE;

	do {
		if (valid) {
			valid = false;
		} else {
			if ((f_read(fp, sector, 1, &bytesRead) != FR_OK) || bytesRead != 1)
				return stm32ipl_err_ReadingFile;
		}

		if (mode == EAT_WHITESPACE) {
			if (sector[0] == '#') {
				mode = EAT_COMMENT;
			} else
				if (('0' <= sector[0]) && (sector[0] <= '9')) {
					number = sector[0] - '0';
					mode = EAT_NUMBER;
				}
		} else
			if (mode == EAT_COMMENT) {
				if ((sector[0] == '\n') || (sector[0] == '\r')) {
					mode = EAT_WHITESPACE;
				}
			} else
				if (mode == EAT_NUMBER) {
					if (('0' <= sector[0]) && (sector[0] <= '9')) {
						number = (number * 10) + sector[0] - '0';
					} else {
						valid = true;
					}
				}
	} while (!valid);

	height = number;
	number = 0;
	mode = EAT_WHITESPACE;

	if (height == 0 || width == 0)
		return stm32ipl_err_InvalidParameter;

	do {
		if (valid) {
			valid = false;
		} else {
			if ((f_read(fp, sector, 1, &bytesRead) != FR_OK) || bytesRead != 1)
				return stm32ipl_err_ReadingFile;
		}

		if (mode == EAT_WHITESPACE) {
			if (sector[0] == '#') {
				mode = EAT_COMMENT;
			} else
				if (('0' <= sector[0]) && (sector[0] <= '9')) {
					number = sector[0] - '0';
					mode = EAT_NUMBER;
				}
		} else
			if (mode == EAT_COMMENT) {
				if ((sector[0] == '\n') || (sector[0] == '\r')) {
					mode = EAT_WHITESPACE;
				}
			} else
				if (mode == EAT_NUMBER) {
					if (('0' <= sector[0]) && (sector[0] <= '9')) {
						number = (number * 10) + sector[0] - '0';
					} else {
						valid = true;
					}
				}
	} while (!valid);

	if (number > 255)
		return stm32ipl_err_Generic;

	switch (number_ppm) {
		case '2': {
			/* "P2" = plain PGM (Grayscale, ASCII). */

			outData = xalloc(width * height);
			if (!outData)
				return stm32ipl_err_OutOfMemory;

