STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_image_io.c
			for (uint32_t i = 0; i < height; i++) {
				uint32_t offset = i * width;

				for (uint32_t j = 0; j < width; j++) {
					number = 0;
					mode = EAT_WHITESPACE;

					do {
						if (valid) {
							valid = false;
						} else {
							if ((f_read(fp, sector, 1, &bytesRead) != FR_OK) || bytesRead != 1)
								return stm32ipl_err_ReadingFile;
						}
						if (mode == EAT_WHITESPACE) {
							if (sector[0] == '#') {
								mode = EAT_COMMENT;
							} else
								if (('0' <= sector[0]) && (sector[0] <= '9')) {
									number = sector[0] - '0';
									mode = EAT_NUMBER;
								}
						} else
							if (mode == EAT_COMMENT) {
								if ((sector[0] == '\n') || (sector[0] == '\r')) {
									mode = EAT_WHITESPACE;
								}
							} else
								if (mode == EAT_NUMBER) {
									if (('0' <= sector[0]) && (sector[0] <= '9')) {
										number = (number * 10) + sector[0] - '0';
									} else {
										valid = true;
									}
								}
					} while (!valid);

					outData[offset + j] = (uint8_t)number;
				}
			}

			STM32Ipl_Init(img, width, height, IMAGE_BPP_GRAYSCALE, outData);

			break;
		}

		case '3': {
			/* "P3" = plain PPM (RGB888, ASCII). */

			uint8_t *outPixel;

			outData = xalloc(width * height * 3);
			if (!outData)
				return stm32ipl_err_OutOfMemory;

			outPixel = outData;

			for (uint32_t i = 0; i < height; i++) {
				for (uint32_t j = 0; j < width; j++) {
					uint8_t pixel[3];

					for (uint8_t counter = 0; counter < 3; counter++) {
						number = 0;
						mode = EAT_WHITESPACE;

						do {
							if (valid) {
								valid = false;
							} else {
								if ((f_read(fp, sector, 1, &bytesRead) != FR_OK) || bytesRead != 1)
									return stm32ipl_err_ReadingFile;
							}

							if (mode == EAT_WHITESPACE) {
								if (sector[0] == '#') {
									mode = EAT_COMMENT;
								} else
									if (('0' <= sector[0]) && (sector[0] <= '9')) {
										number = sector[0] - '0';
										mode = EAT_NUMBER;
									}
							} else
								if (mode == EAT_COMMENT) {
									if ((sector[0] == '\n') || (sector[0] == '\r')) {
										mode = EAT_WHITESPACE;
									}
								} else
									if (mode == EAT_NUMBER) {
										if (('0' <= sector[0]) && (sector[0] <= '9')) {
											number = (number * 10) + sector[0] - '0';
										} else {
											valid = true;
										}
									}
						} while (!valid);

						pixel[counter] = number;
					}

					*outPixel++ = pixel[2];
					*outPixel++ = pixel[1];
					*outPixel++ = pixel[0];

				}
			}

			STM32Ipl_Init(img, width, height, IMAGE_BPP_RGB888, outData);

			break;
		}

		case '5': {
			/* "P5" = raw PGM (Grayscale). */

			size = width * height;
			outData = xalloc(size);
			if (!outData)
				return stm32ipl_err_OutOfMemory;

			if ((f_read(fp, outData, size, &bytesRead) != FR_OK) || bytesRead != size)
				return stm32ipl_err_ReadingFile;

			STM32Ipl_Init(img, width, height, IMAGE_BPP_GRAYSCALE, outData);

			break;
		}

		case '6': {
			/* "P6" = raw PPM (RGB888). */

			size = width * height * 3;

			outData = xalloc(size);
			if (!outData)
				return stm32ipl_err_OutOfMemory;

			if ((f_read(fp, outData, size, &bytesRead) != FR_OK) || bytesRead != size)
				return stm32ipl_err_ReadingFile;

			for (uint32_t i = 0; i < size; i += 3) {
				uint8_t tmp = outData[i];
				outData[i] = outData[i + 2];
				outData[i + 2] = tmp;
			}

			STM32Ipl_Init(img, width, height, IMAGE_BPP_RGB888, outData);

			break;
		}

		default:
			return stm32ipl_err_UnsupportedFormat;
	}

	return stm32ipl_err_Ok;
}

#ifdef STM32IPL_ENABLE_JPEG
/* Reads JPEG image file; the generated image will be Grayscale or RGB565 depending on the actual
 * image content; depending on the configuration file (stm32ipl_conf.h) the SW or the HW JPEG
 * decoder will be used.
 * img		Image read; the pixel data is allocated internally and must be released
 * with STM32Ipl_ReleaseData(); assuming that input img->data is null.
 * fp		Pointer to the input file structure.
 * return	stm32ipl_err_Ok on success, errors otherwise.
 */
static stm32ipl_err_t readJpg(image_t *img, FIL *fp)
{
#ifdef STM32IPL_ENABLE_HW_JPEG_CODEC
	return readJPEGHW(img, fp);
#else
	return readJPEGSW(img, fp);
#endif
}
#endif /* STM32IPL_ENABLE_JPEG */

/**
 * @brief Reads image file; supported file formats are: BMP, PPM, PGM, JPG.
 * - BMP: supported files are: 1, 4, 8 bits/pixel with palette; 16 bits/pixels
 * with or without BITFIELDS; 24 bits/pixels; compressed BI_RGB and BI_BITFIELDS.
 * The generated image will be:
 * 	* Binary in case the input file has 1 bit/pixel with black and white palette.
 * 	* Grayscale in case the input file has 8 bits/pixel with a complete grayscale
 * 	palette (equal RGB channels for all the palette items).
 * 	* RGB565 in case the input file has 16 bits/pixel (RGB555 or RGB565).
 * 	* RGB888 in case the input file has 24 bits/pixel.
 * - PPM: the generated image will be RGB888.
 * - PGM: the generated image will be Grayscale.
 * - JPEG: the generated image will be Grayscale or RGB565, depending on the actual image content.
 * Depending on the configuration file (stm32ipl_conf.h) the SW or the HW JPEG decoder will be used.
 * @param img		Image: if it is not valid, an error is returned; the given img->data is considered null.
 * The pixel data buffer is allocated internally and must be released with STM32Ipl_ReleaseData() by the caller.
 * @param filename	Name of the input file.
 * @return			stm32ipl_err_Ok on success, errors otherwise.
 */
stm32ipl_err_t STM32Ipl_ReadImage(image_t *img, const char *filename)
{
	FIL fp;
	uint32_t bytesRead = 0;
	uint8_t magic[2];
	stm32ipl_err_t res;

	const uint8_t bmp[2] = { 0x42, 0x4D }; /* BM */
	const uint8_t p2[2] = { 0x50, 0x32 }; /* P2 */
	const uint8_t p3[2] = { 0x50, 0x33 }; /* P3 */
	const uint8_t p5[2] = { 0x50, 0x35 }; /* P5 */
	const uint8_t p6[2] = { 0x50, 0x36 }; /* P6 */
#ifdef STM32IPL_ENABLE_JPEG
	const uint8_t jpg[2] = { 0xFF, 0xD8 }; /* FFD8 */
#endif /* STM32IPL_ENABLE_JPEG */

	if (!img || !filename)
		return stm32ipl_err_InvalidParameter;

