STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_image_io.c
	if (f_open(&fp, (const TCHAR*)filename, FA_OPEN_EXISTING | FA_READ) != FR_OK)
		return stm32ipl_err_OpeningFile;

	if ((f_read(&fp, magic, 2, (UINT*)&bytesRead) != FR_OK) || bytesRead != 2) {
		f_close(&fp);
		return stm32ipl_err_ReadingFile;
	}

	if (memcmp(bmp, magic, 2) == 0)
		res = readBmp(img, &fp);
	else
		if ((memcmp(p2, magic, 1) == 0)
				&& ((memcmp(p2, magic, 2) == 0) || (memcmp(p3, magic, 2) == 0) || (memcmp(p5, magic, 2) == 0)
						|| (memcmp(p6, magic, 2) == 0)))
			res = readPnm(img, &fp);
		else
#ifdef STM32IPL_ENABLE_JPEG
			if (memcmp(jpg, magic, 2) == 0)
				res = readJpg(img, &fp);
			else
#endif /* STM32IPL_ENABLE_JPEG */
				res = stm32ipl_err_UnsupportedFormat;

	f_close(&fp);

	return res;
}

/* Writes the BMP header to the file.
 * fp			Pointer to the input file structure.
 * width		Width of the image.
 * height		Height of the image.
 * dataOffset	Offset, in bytes, from the beginning of the file to the image pixels.
 * lineSize		Size of a bitmap line (in bytes).
 * bitsPP		Number of bits per pixel.
 * compression	The type of compression used (0 or BI_BITFIELDS).
 * paletteColorUsed	The number of palette items used.
 * return stm32ipl_err_Ok on success, errors otherwise.
 */
static stm32ipl_err_t writeBmpHeader(FIL *fp, uint32_t width, uint32_t height, uint32_t dataOffset, uint32_t lineSize,
		uint32_t bitsPP, uint32_t compression, uint32_t paletteColorUsed)
{
	FRESULT res;
	uint8_t header[54];
	uint32_t fileSize;
	uint32_t imageSize;
	UINT bytesWritten;

	memset(&header, 0, 54);

	imageSize = lineSize * height;
	fileSize = dataOffset + imageSize;

	/* Write header. */

	/* Signature. */
	header[0] = 'B';
	header[1] = 'M';

	/* File size. */
	header[2] = (uint8_t)((fileSize & 0XFF));
	header[3] = (uint8_t)((fileSize >> 8) & 0XFF);
	header[4] = (uint8_t)((fileSize >> 16) & 0xFF);
	header[5] = (uint8_t)((fileSize >> 24) & 0xFF);

	/* Data offset. */
	header[10] = (uint8_t)((dataOffset & 0XFF));
	header[11] = (uint8_t)((dataOffset >> 8) & 0XFF);
	header[12] = (uint8_t)((dataOffset >> 16) & 0xFF);
	header[13] = (uint8_t)((dataOffset >> 24) & 0xFF);

	/* biSize (version 3). */
	header[14] = 40;

	/* biWidth. */
	header[18] = (uint8_t)((width & 0XFF));
	header[19] = (uint8_t)((width >> 8) & 0xFF);
	header[20] = (uint8_t)((width >> 16) & 0xFF);
	header[21] = (uint8_t)((width >> 24) & 0xFF);

	/* biHeight. */
	header[22] = (uint8_t)((height & 0XFF));
	header[23] = (uint8_t)((height >> 8) & 0xFF);
	header[24] = (uint8_t)((height >> 16) & 0xFF);
	header[25] = (uint8_t)((height >> 24) & 0xFF);

	/* biPlanes. */
	header[26] = 1;

	/* biBitCount. */
	header[28] = (uint8_t)((bitsPP & 0XFF));
	header[29] = (uint8_t)((bitsPP >> 8) & 0xFF);

	/* biCompression. */
	header[30] = (uint8_t)compression;

	/* biSizeImage. */
	header[34] = (uint8_t)((imageSize & 0XFF));
	header[35] = (uint8_t)((imageSize >> 8) & 0xFF);
	header[36] = (uint8_t)((imageSize >> 16) & 0xFF);
	header[37] = (uint8_t)((imageSize >> 24) & 0xFF);

	/* biXPelsPerMeter. */
	header[38] = (uint8_t)((2835 & 0XFF));
	header[39] = (uint8_t)((2835 >> 8) & 0xFF);
	header[40] = (uint8_t)((2835 >> 16) & 0xFF);
	header[41] = (uint8_t)((2835 >> 24) & 0xFF);

	/* biYPelsPerMeter. */
	header[42] = (uint8_t)((2835 & 0XFF));
	header[43] = (uint8_t)((2835 >> 8) & 0xFF);
	header[44] = (uint8_t)((2835 >> 16) & 0xFF);
	header[45] = (uint8_t)((2835 >> 24) & 0xFF);

	/* biClrUsed. */
	header[46] = (uint8_t)((paletteColorUsed & 0XFF));
	header[47] = (uint8_t)((paletteColorUsed >> 8) & 0xFF);
	header[48] = (uint8_t)((paletteColorUsed >> 16) & 0xFF);
	header[49] = (uint8_t)((paletteColorUsed >> 24) & 0xFF);

	/* biClrImportant. */
	//header[50] = 0;
	/* Write header */
	res = f_write(fp, header, 14, &bytesWritten);
	if (res != FR_OK || bytesWritten != 14)
		return stm32ipl_err_WritingFile;

	res = f_write(fp, header + 14, 40, &bytesWritten);
	if (res != FR_OK || bytesWritten != 40)
		return stm32ipl_err_WritingFile;

	return stm32ipl_err_Ok;
}

/* Reverse the input bits.
 * val 		Input value to be reversed.
 * return	Reversed input.
 */
static uint8_t reverse8(uint8_t val)
{
	int size = sizeof(val) * CHAR_BIT - 1;
	uint8_t rev = val;

	for (val >>= 1; val; val >>= 1) {
		rev <<= 1;
		rev |= val & 1;
		size--;
	}
	rev <<= size;

	return rev;
}

/*
 * Write the given image to BMP file; the supported source image formats are:
 * Binary, Grayscale, RGB565, RGB888:
 * - Binary image is saved as 1 bit B&W BMP.
 * - Grayscale image is saved as 8 bits grayscale BMP.
 * - RGB565 image is saved as 16 bits BMP with BITFIELDS.
 * - RGB888 image is saved as 24 bits BMP.
 * img		Image to be saved.
 * filename	Name of the output file.
 * return	stm32ipl_err_Ok on success, error otherwise.
 */
static stm32ipl_err_t saveBmp(const image_t *img, const char *filename)
{
	FIL fp;
	FRESULT res;
	uint32_t width;
	uint32_t height;
	uint32_t lineSize;
	uint32_t padding;
	UINT bytesWritten;

	width = img->w;
	height = img->h;

	if (f_open(&fp, (const TCHAR*)filename, FA_WRITE | FA_CREATE_ALWAYS) != FR_OK)
		return stm32ipl_err_OpeningFile;

	switch (img->bpp) {
		case IMAGE_BPP_BINARY: {
			uint32_t palette = 0;
			lineSize = (((width) + 31) / 32) * 4;

			/* Header. */
			if (stm32ipl_err_Ok != writeBmpHeader(&fp, width, height, 54 + 8, lineSize, 1, 0, 2)) {
				f_close(&fp);
				return stm32ipl_err_WritingFile;
			}

			/* Palette. */
			res = f_write(&fp, &palette, sizeof(palette), &bytesWritten);
			if (res != FR_OK || bytesWritten != sizeof(palette)) {
				f_close(&fp);
				return stm32ipl_err_WritingFile;
			}
			palette = 0xFFFFFF;
			res = f_write(&fp, &palette, sizeof(palette), &bytesWritten);
			if (res != FR_OK || bytesWritten != sizeof(palette)) {
				f_close(&fp);
				return stm32ipl_err_WritingFile;
			}

			for (int32_t i = height - 1; i >= 0; i--) {
				uint32_t offset = i * lineSize;
				uint8_t *srcData = img->data + offset;

				/* Image data. */
				for (uint32_t j = 0; j < lineSize; j++) {
					uint8_t dstData = reverse8(*(srcData + j));

					res = f_write(&fp, &dstData, 1, &bytesWritten);
					if (res != FR_OK || bytesWritten != 1) {
						f_close(&fp);
						return stm32ipl_err_WritingFile;
					}
				}
			}
			break;
		}

