STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_image_io.c
		case IMAGE_BPP_GRAYSCALE: {
			lineSize = (((width * 8) + 31) / 32) * 4;
			padding = lineSize - width;

			/* Header. */
			if (stm32ipl_err_Ok != writeBmpHeader(&fp, width, height, 54 + 1024, lineSize, 8, 0, 256)) {
				f_close(&fp);
				return stm32ipl_err_WritingFile;
			}

			/* Palette. */
			for (uint32_t i = 0; i < 256; i++) {
				uint32_t value = (i << 16) | (i << 8) | i;
				res = f_write(&fp, &value, sizeof(value), &bytesWritten);
				if (res != FR_OK || bytesWritten != 4) {
					f_close(&fp);
					return stm32ipl_err_WritingFile;
				}
			}

			for (int32_t i = height - 1; i >= 0; i--) {
				uint32_t offset = i * width;

				/* Image data. */
				res = f_write(&fp, img->data + offset, width, &bytesWritten);
				if (res != FR_OK || bytesWritten != width) {
					f_close(&fp);
					return stm32ipl_err_WritingFile;
				}

				/* Padding. */
				for (uint32_t j = 0; j < padding; j++) {
					if (1 != f_putc(0, &fp)) {
						f_close(&fp);
						return stm32ipl_err_WritingFile;
					}
				}
			}
			break;
		}

		case IMAGE_BPP_RGB565: {
			uint32_t mask;
			uint32_t dataLen = width << 1;
			lineSize = (((width * 16) + 31) / 32) * 4;
			padding = lineSize - dataLen;

			/* Header. */
			if (stm32ipl_err_Ok != writeBmpHeader(&fp, width, height, 14 + 40 + 12, lineSize, 16, BI_BITFIELDS, 0)) {
				f_close(&fp);
				return stm32ipl_err_WritingFile;
			}

			/* Bit masks. */
			mask = 0xF800;
			res = f_write(&fp, &mask, 4, &bytesWritten);
			if (res != FR_OK || bytesWritten != 4) {
				f_close(&fp);
				return stm32ipl_err_WritingFile;
			}
			mask = 0x7E0;
			res = f_write(&fp, &mask, 4, &bytesWritten);
			if (res != FR_OK || bytesWritten != 4) {
				f_close(&fp);
				return stm32ipl_err_WritingFile;
			}
			mask = 0x1F;
			res = f_write(&fp, &mask, 4, &bytesWritten);
			if (res != FR_OK || bytesWritten != 4) {
				f_close(&fp);
				return stm32ipl_err_WritingFile;
			}

			for (int32_t i = height - 1; i >= 0; i--) {
				uint32_t offset = i * width;

				/* Image data. */
				res = f_write(&fp, ((uint16_t*)img->data) + offset, dataLen, &bytesWritten);
				if (res != FR_OK || bytesWritten != dataLen) {
					f_close(&fp);
					return stm32ipl_err_WritingFile;
				}

				/* Padding. */
				for (uint32_t j = 0; j < padding; j++) {
					if (1 != f_putc(0, &fp)) {
						f_close(&fp);
						return stm32ipl_err_WritingFile;
					}
				}
			}

			break;
		}

		case IMAGE_BPP_RGB888: {
			uint32_t dataLen = width * 3;
			lineSize = (((width * 24) + 31) / 32) * 4;
			padding = lineSize - dataLen;

			/* Header. */
			if (stm32ipl_err_Ok != writeBmpHeader(&fp, width, height, 14 + 40, lineSize, 24, 0, 0)) {
				f_close(&fp);
				return stm32ipl_err_WritingFile;
			}

			for (int32_t i = height - 1; i >= 0; i--) {
				uint8_t *data = img->data + i * dataLen;

				/* Image data. */
				res = f_write(&fp, data, dataLen, &bytesWritten);
				if (res != FR_OK || bytesWritten != dataLen) {
					f_close(&fp);
					return stm32ipl_err_WritingFile;
				}

				/* Padding. */
				for (uint32_t j = 0; j < padding; j++) {
					if (1 != f_putc(0, &fp)) {
						f_close(&fp);
						return stm32ipl_err_WritingFile;
					}
				}
			}

			break;
		}

		default: {
			f_close(&fp);
			return stm32ipl_err_InvalidParameter;
		}
	};

	f_close(&fp);

	return stm32ipl_err_Ok;
}

/*
 * Writes the given image to raw PNM file (PPM or PGM); the supported source image formats are:
 * Grayscale, RGB565, RGB888:
 * - Binary is not supported.
 * - Grayscale is saved as 8 bits PGM.
 * - RGB565 is saved as 24 bits PPM.
 * - RGB888 is saved as 24 bits PPM.
 * img		Image to be saved.
 * filename	Name of the output file.
 * format	Format of the PNM file (6 if the input image is RGB565 or RGB888, 5 if it's Grayscale).
 * return	stm32ipl_err_Ok on success, error otherwise.
 */
static stm32ipl_err_t savePnm(const image_t *img, const char *filename, uint8_t format)
{
	FIL fp;
	FRESULT res;
	uint32_t size;
	int32_t width;
	int32_t height;
	char text[64];
	UINT bytesWritten;
	uint32_t offset;

	width = img->w;
	height = img->h;

	/* Write header. */
	size = snprintf(text, sizeof(text), "P%d\n# Created by STM32IPL\n%ld %ld\n255\n", format, width, height);

	if (f_open(&fp, (const TCHAR*)filename, FA_WRITE | FA_CREATE_ALWAYS) != FR_OK)
		return stm32ipl_err_OpeningFile;

	res = f_write(&fp, text, size, &bytesWritten);
	if (res != FR_OK || bytesWritten != size) {
		f_close(&fp);
		return stm32ipl_err_WritingFile;
	}

	switch (img->bpp) {
		/* TODO: case IMAGE_BPP_BINARY */

		case IMAGE_BPP_GRAYSCALE: {
			size = width * height;

			res = f_write(&fp, img->data, size, &bytesWritten);
			if (res != FR_OK || bytesWritten != size) {
				f_close(&fp);
				return stm32ipl_err_WritingFile;
			}
			break;
		}

		case IMAGE_BPP_RGB565: {
			for (uint32_t i = 0; i < height; i++) {
				offset = i * width;

				for (uint32_t j = 0; j < width; j++) {
					rgb888_t rgb888;
					uint16_t rgb565 = *(((uint16_t*)img->data) + offset + j);

					/* R and B must be swapped. */
					rgb888.r = COLOR_RGB565_TO_B8(rgb565);
					rgb888.g = COLOR_RGB565_TO_G8(rgb565);
					rgb888.b = COLOR_RGB565_TO_R8(rgb565);

					res = f_write(&fp, &rgb888, 3, &bytesWritten);
					if (res != FR_OK || bytesWritten != 3) {
						f_close(&fp);
						return stm32ipl_err_WritingFile;
					}
				}
			}
			break;
		}

		case IMAGE_BPP_RGB888: {
			uint8_t *data = img->data;
			size = width * height;

			for (uint32_t i = 0; i < size; i++) {
				rgb888_t rgb888;

				/* R and B must be swapped. */
				rgb888.r = *data++;
				rgb888.g = *data++;
				rgb888.b = *data++;

				res = f_write(&fp, &rgb888, 3, &bytesWritten);
				if (res != FR_OK || bytesWritten != 3) {
					f_close(&fp);
					return stm32ipl_err_WritingFile;
				}
			}

			break;
		}

		default: {
			f_close(&fp);
			return stm32ipl_err_UnsupportedFormat;
		}
	}

	f_close(&fp);

	return stm32ipl_err_Ok;
}

/* Checks if the format of the input image is compatible with the PPM file extension.
 * In case of success, it writes the given image to raw PPM;
 * the supported source image formats are RGB565, RGB888:
 * - Binary is not supported.
 * - Grayscale is not compatible with PGM.
 * - RGB565 is saved as 24 bits PPM.
 * - RGB888 is saved as 24 bits PPM.
 * img		Image to be saved.
 * filename	Name of the output file.
 * return	stm32ipl_err_Ok on success, error otherwise.
 */
static stm32ipl_err_t savePpm(const image_t *img, const char *filename)
{
	uint8_t format;

