STMicroelectronics/stm32ai-modelzoo/stm32ai_application_code/object_detection/Middlewares/ST/STM32_ImageProcessing_Library/Src/stm32ipl_image_io.c
	switch (img->bpp) {
		case IMAGE_BPP_BINARY:
		case IMAGE_BPP_GRAYSCALE:
			return stm32ipl_err_UnsupportedFormat;

		case IMAGE_BPP_RGB565:
		case IMAGE_BPP_RGB888: {
			format = 6;
			break;
		}

		default:
			return stm32ipl_err_UnsupportedFormat;
	}

	return savePnm(img, filename, format);
}

/* Checks if the format of the input image is compatible with the PGM file extension.
 * In case of success, it writes the given image to raw PGM;
 * the supported source image format is Grayscale:
 * - Binary is not supported.
 * - Grayscale is saved as 8 bits PGM.
 * - RGB565 is not compatible with PGM.
 * - RGB888 is not compatible with PGM.
 * img		Image to be saved.
 * filename	Name of the output file.
 * return	stm32ipl_err_Ok on success, error otherwise.
 */
static stm32ipl_err_t savePgm(const image_t *img, const char *filename)
{
	uint8_t format;

	switch (img->bpp) {
		case IMAGE_BPP_BINARY:
			return stm32ipl_err_UnsupportedFormat;

		case IMAGE_BPP_GRAYSCALE:
			format = 5;
			break;

		case IMAGE_BPP_RGB565:
		case IMAGE_BPP_RGB888: {
			return stm32ipl_err_UnsupportedFormat;
		}

		default:
			return stm32ipl_err_UnsupportedFormat;
	}

	return savePnm(img, filename, format);
}

#ifdef STM32IPL_ENABLE_JPEG
/* Writes the given image to JPEG file; the supported source image formats are:
 * Grayscale, RGB565 and RGB888:
 * - Binary is not supported.
 * - Grayscale is saved as grayscale JPEG.
 * - RGB565 is saved as full-color JPEG.
 * - RGB888 is saved as full-color JPEG.
 * Depending on the configuration file (stm32ipl_conf.h) the SW or the HW
 * JPEG encoder will be used.
 * img		Image to be saved.
 * filename	Name of the output file.
 * return	stm32ipl_err_Ok on success, error otherwise.
 */
static stm32ipl_err_t saveJpg(const image_t *img, const char *filename)
{
	if (img->bpp == IMAGE_BPP_BINARY)
		return stm32ipl_err_UnsupportedFormat;

#ifdef STM32IPL_ENABLE_HW_JPEG_CODEC
	stm32ipl_err_t res;
	/* If input image has RGB888 format, due to the jpeg_util implementation,
	 * a formal conversion to RGB565 is needed. */
	if (img->bpp == IMAGE_BPP_RGB888) {
		image_t tmpImg;
		if (STM32Ipl_AllocData(&tmpImg, img->w, img->h, IMAGE_BPP_RGB565))
			return stm32ipl_err_OutOfMemory;

		if (STM32Ipl_Convert(img, &tmpImg))
			return stm32ipl_err_UnsupportedFormat;

		res = saveJPEGHW(&tmpImg, filename);

		STM32Ipl_ReleaseData(&tmpImg);

		return res;
	} else
		return saveJPEGHW(img, filename);
#else
	return saveJPEGSW(img, filename);
#endif
}
#endif /* STM32IPL_ENABLE_JPEG */

/**
 * @brief Writes the given image to file; the target file format is determined
 * by the filename extension; the supported output file formats are: BMP, PPM, PGM, JPG.
 * The supported source image formats are: Binary, Grayscale, RGB565 and RGB888:
 * - Binary can be saved to BMP only
 * - Grayscale can be saved to BMP, raw PGM or JPEG
 * - RGB565 can be saved to BMP, PPM or JPEG
 * - RGB888 can be saved to BMP, PPM or JPEG
 * Depending on the configuration file (stm32ipl_conf.h) the SW or the HW
 * JPEG encoder will be used.
 * img		Image to be saved; if it is not valid, an error is returned.
 * filename	Name of the output file; if it is not valid, an error is returned.
 * return	stm32ipl_err_Ok on success, error otherwise.
 */
stm32ipl_err_t STM32Ipl_WriteImage(const image_t *img, const char *filename)
{
	if (!img || !img->data || !filename)
		return stm32ipl_err_InvalidParameter;

	if (img->bpp != IMAGE_BPP_BINARY && img->bpp != IMAGE_BPP_GRAYSCALE && img->bpp != IMAGE_BPP_RGB565
			&& img->bpp != IMAGE_BPP_RGB888)
		return stm32ipl_err_UnsupportedFormat;

	switch (getImageFileFormat(filename)) {
		case iplFileFormatBMP:
			return saveBmp(img, filename);

		case iplFileFormatPPM:
			return savePpm(img, filename);

		case iplFileFormatPGM:
			return savePgm(img, filename);

#ifdef STM32IPL_ENABLE_JPEG
		case iplFileFormatJPG:
			return saveJpg(img, filename);
#endif /* STM32IPL_ENABLE_JPEG */

		default:
			break;
	}

	return stm32ipl_err_UnsupportedFormat;
}

#ifdef __cplusplus
}
#endif

#else  /* STM32IPL_ENABLE_IMAGE_IO */

#ifdef __cplusplus
extern "C" {
#endif

stm32ipl_err_t STM32Ipl_ReadImage(image_t *img, const char *filename)
{
	/* Prevent unused argument(s) compilation warning. */
	STM32IPL_UNUSED(img);
	STM32IPL_UNUSED(filename);

	/* Void implementation. */
	return stm32ipl_err_NotImplemented;
}

stm32ipl_err_t STM32Ipl_WriteImage(const image_t *img, const char *filename)
{
	/* Prevent unused argument(s) compilation warning. */
	STM32IPL_UNUSED(img);
	STM32IPL_UNUSED(filename);

	/* Void implementation. */
	return stm32ipl_err_NotImplemented;
}

#ifdef __cplusplus
}
#endif

#endif /* STM32IPL_ENABLE_IMAGE_IO */
